export default {
  // Частые переводы
  cancel: 'Отмена',
  and: 'и',
  yes: 'Да',
  you: 'Вы',
  you2: 'Вас',
  loading: 'Загрузка...',
  send: 'Отправить',

  // Время
  date_now: 'только что',
  date_at: 'в',
  today: 'сегодня',
  yesterday: 'вчера',

  dark_theme: ['Включить темную тему', 'Выключить темную тему'],

  // Авторизация
  available_accounts_list: 'Список доступных аккаунтов',
  enter_login: 'Введите логин',
  enter_password: 'Введите пароль',
  wrong_login_or_password: 'Неверный логин или пароль',
  security_check: 'Проверка безопасности',
  enter_code: 'Введите код',
  wrong_code: 'Неверный код',
  code_sent_to: [
    'Код отправлен на номер {0}',
    'Введите код из сообщения от Администрации или из приложения для генерации кодов'
  ],
  your_page_blocked: 'Ваша страница заблокирована',
  login: 'Войти',
  logout: 'Выход',

  // Меню
  menu: {
    messages: 'Сообщения'
  },

  // Сообщения
  im_header_title: 'Сообщения',
  im_choose_chat_1: 'Выберите диалог или',
  im_choose_chat_2: 'создайте новый',
  im_chat_members: ['{0} участник', '{0} участника', '{0} участников'],
  im_chat_online: ['Онлайн', 'Онлайн с телефона', 'Онлайн с {0}'],
  im_chat_was_online: ['Был в сети {0}', 'Была в сети {0}'],
  im_chat_group: 'Сообщество',
  im_chat_cant_write: 'Отправка сообщений ограничена',
  im_chat_left: 'Вы вышли из беседы',
  im_chat_left_channel: 'Вы отписаны от канала',
  im_chat_kicked: 'Вы исключены из беседы',
  im_user_deleted: 'Страница удалена',
  im_input_placeholder: 'Введите сообщение...',
  im_empty_dialog: 'Ваш список сообщений пуст',
  im_unread_messages: 'Новые сообщения',
  im_msg_edited: 'ред.',
  im_toggle_notifications: ['Включить уведомления', 'Отключить уведомления'],
  im_clear_history: 'Удалить историю',
  im_toggle_left_state: [
    'Покинуть беседу',
    'Вернуться в беседу',
    'Отписаться от канала',
    'Подписаться на канал'
  ],

  im_typing_text: ['{0} печатает', '{0} и {1} печатают', '{0} и еще {1} печатают'],
  im_typing_audio: ['{0} записывает аудио', '{0} и {1} записывают аудио', '{0} и еще {1} записывают аудио'],

  // Вложения в сообщениях
  im_replied: 'Ответ на сообщение',
  im_forwarded: ['{0} пересланное сообщение', '{0} пересланных сообщения', '{0} пересланных сообщений'],
  im_attachments: {
    geo: 'Карта',
    doc: 'Документ',
    link: 'Ссылка',
    poll: 'Опрос',
    wall: 'Запись на стене',
    call: 'Звонок',
    gift: 'Подарок',
    story: 'История',
    photo: 'Фотография',
    audio: 'Аудиозапись',
    video: 'Видеозапись',
    point: 'Местоположение',
    market: 'Товар',
    sticker: 'Стикер',
    article: 'Статья',
    podcast: 'Подкаст',
    graffiti: 'Граффити',
    wall_reply: 'Комментарий на стене',
    audio_message: 'Голосовое сообщение',
    money_request: 'Запрос денег',
    audio_playlist: 'Плейлист'
  },

  // Сервисные сообщения
  im_chat_photo_update: [
    '<b>Вы</b> обновили фотографию беседы',
    '<b>{0}</b> обновил фотографию беседы',
    '<b>{0}</b> обновила фотографию беседы'
  ],
  im_chat_photo_remove: [
    '<b>Вы</b> удалили фотографию беседы',
    '<b>{0}</b> удалил фотографию беседы',
    '<b>{0}</b> удалила фотографию беседы'
  ],
  im_chat_create: [
    '<b>Вы</b> создали беседу «<b>{1}</b>»',
    '<b>{0}</b> создал беседу «<b>{1}</b>»',
    '<b>{0}</b> создала беседу «<b>{1}</b>»'
  ],
  im_chat_title_update: [
    '<b>Вы</b> изменили название беседы на «<b>{1}</b>»',
    '<b>{0}</b> изменил название беседы на «<b>{1}</b>»',
    '<b>{0}</b> изменила название беседы на «<b>{1}</b>»'
  ],
  im_chat_pin_message: [
    '<b>Вы</b> закрепили сообщение «<b>{1}</b>»',
    '<b>{0}</b> закрепил сообщение «<b>{1}</b>»',
    '<b>{0}</b> закрепила сообщение «<b>{1}</b>»'
  ],
  im_chat_unpin_message: [
    '<b>Вы</b> открепили <b>сообщение</b>',
    '<b>{0}</b> открепил <b>сообщение</b>',
    '<b>{0}</b> открепила <b>сообщение</b>'
  ],
  im_chat_invite_user_by_link: [
    '<b>Вы</b> присоединились к беседе по ссылке',
    '<b>{0}</b> присоединился к беседе по ссылке',
    '<b>{0}</b> присоединилась к беседе по ссылке'
  ],
  im_chat_returned_user: [
    '<b>Вы</b> вернулись в беседу',
    '<b>{0}</b> вернулся в беседу',
    '<b>{0}</b> вернулась в беседу'
  ],
  im_chat_invite_user: [
    '<b>Вы</b> пригласили <b>{1}</b>',
    '<b>{0}</b> пригласил <b>{1}</b>',
    '<b>{0}</b> пригласила <b>{1}</b>'
  ],
  im_chat_left_user: [
    '<b>Вы</b> вышли из беседы',
    '<b>{0}</b> вышел из беседы',
    '<b>{0}</b> вышла из беседы'
  ],
  im_chat_kick_user: [
    '<b>Вы</b> исключили <b>{1}</b>',
    '<b>{0}</b> исключил <b>{1}</b>',
    '<b>{0}</b> исключила <b>{1}</b>'
  ],
  // Короткие версии, отображаемые в списке диалогов
  im_chat_invite_user_short: [
    '<b>Вас</b> пригласили в беседу',
    '<b>{0}</b> пригласили в беседу',
    '<b>{0}</b> пригласили в беседу'
  ],
  im_chat_kick_user_short: [
    '<b>Вас</b> исключили из беседы',
    '<b>{0}</b> исключили из беседы',
    '<b>{0}</b> исключили из беседы'
  ],

  // Капча
  ml_captcha_header: 'Введите капчу',
  ml_captcha_write: 'Введите код с картинки',

  // Выход из аккаунта
  ml_logout_header: 'Выход из аккаунта',
  ml_logout_sure: 'Вы действительно хотите выйти из аккаунта?',

  // Проблемы с токеном
  ml_blocked_account_title: [
    'Сессия недействительна',
    'Страница удалена',
    'Страница заблокирована'
  ],
  ml_blocked_account_content: [
    `Возможно, вы удалили приложение из списка активных либо завершили все сеансы.<br><br>
    Дальнейшая работа приложения невозможна.`,
    `Ваша страница удалена.<br><br>
    После восстановления страницы вы можете снова пользоваться приложением.`,
    `Ваша страница была заблокирована.<br><br>
    Восстановите аккаунт и вернитесь позже.`
  ],
  ml_blocked_account_logout: 'Выйти из аккаунта',
  ml_blocked_account_close_app: 'Закрыть приложение',

  // Мультиаккаунт
  ml_multiacc_header: 'Выберите аккаунт',
  ml_multiacc_add_account: 'Добавить аккаунт',
  ml_multiacc_active_account: 'Активный аккаунт',

  // Модалка авторизации
  ml_auth_header: 'Авторизация',

  // Удаление истории сообщений
  ml_clear_history_header: 'Удалить все сообщения',
  ml_clear_history_text: 'Вы действительно хотите удалить всю переписку в этой беседе?'
}
